Revit 2027 API
ThermalAsset.Emissivity Property
 The emissivity of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Emissivity { get; set; }
Public Property Emissivity As Double
	Get
	Set
public:
property double Emissivity {
	double get ();
	void set (double value);
}
member Emissivity : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for emissivity is out of range
Remarks
 Values must be in the range 0 to 1.
See Also
Reference
ThermalAsset Class
Autodesk.Revit.DB Namespace